In [10]:
import pandas as pd 
data = [1,2,3,4,5]  
series = pd.Series(data)
print(" Series :\n", series)
print(type(series))
series.sum()

 Series :
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

np.int64(15)

In [ ]:
import pandas as pd 

data = { 'Name': ['Karan', 'Neha', 'Amit'],
        'Age ': [23,44,45],
        'Place ': ['delhi ', 'U.P', 'Bihar'],
        'job ': ['Engineer', 'Doctor', 'Lawyer']}
df = pd.DataFrame(data)
print("DataFrame :\n", df)
print(type(df))
df.head()
df.tail(3)
df.isnull()
df.describe()
df.dropna()
df.fillna(0)

DataFrame :
     Name  Age   Place       job
0  Karan    23  delhi   Engineer
1   Neha    44     U.P    Doctor
2   Amit    45   Bihar    Lawyer
<class 'pandas.core.frame.DataFrame'>

    Name  Age   Place       job
0  Karan    23  delhi   Engineer
1   Neha    44     U.P    Doctor
2   Amit    45   Bihar    Lawyer

In [5]:
import numpy as np

np.array(df)

array([['Karan', 23, 'delhi '],
       ['Neha', 44, 'U.P'],
       ['Amit', 45, 'Bihar']], dtype=object)

In [ ]:
import pandas as pd
df = pd.read_csv('data.csv')  #Reading a CSV file into a DataFrame  #Displaying the first few rows of the DataFrame
df.head(10)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North
5  2023-01-06        B   54.0  Product3  192.0   West
6  2023-01-07        A   16.0  Product1  936.0   East
7  2023-01-08        C   89.0  Product1  488.0   West
8  2023-01-09        C   37.0  Product3  772.0   West
9  2023-01-10        A   22.0  Product2  834.0   West

In [ ]:
#agregate functions
group_mean = df.groupby(['Category'])['Value'].mean()  #Grouping data by 'Category' and calculating the mean of 'Value'
print(group_mean)

Category
A    48.357143
B    44.142857
C    59.842105
Name: Value, dtype: float64